tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "floatpane/matcha"
tap "koekeishiya/formulae"
tap "metafates/mangal"
tap "nikitabobko/tap"
# Open-source formatting library for C++
brew "fmt"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Utility for downloading TV and radio programmes from BBC iPlayer
brew "get_iplayer"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Post-modern modal text editor
brew "helix"
# Convert images to PDF via direct JPEG inclusion
brew "img2pdf"
# Generic library support script
brew "libtool"
# Collect a dossier on a person by username from thousands of sites
brew "maigret"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Safe, concurrent, practical language
brew "rust"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl3"
# Semi-automatic OSINT framework and package manager
brew "sn0int"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Music Player TUI written in Rust
brew "termusic"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Internet file retriever
brew "wget"
# Fake keyboard/mouse input and window management for X
brew "xdotool"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# A beautiful and functional email client for your terminal.
brew "floatpane/matcha/matcha"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
# Application launcher and productivity software
cask "alfred"
# Voice and text chat software
cask "discord"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open-source video transcoder
cask "handbrake-app"
# Free and open-source media player
cask "iina"
# Jellyfin desktop client
cask "jellyfin-media-player"
# Web browser
cask "librewolf"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Clipboard manager
cask "maccy"
# Minecraft launcher
cask "prismlauncher"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Online multiplayer game platform
cask "roblox"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Easy to use text extraction tool
cask "trex"
go "github.com/leotaku/kojirou"
